Section 11: Files/Section 11.org
#+TITLE: Section 11
#+SUBTITLE: Files
#+AUTHOR: Mohammed Asir Shahid
#+EMAIL: MohammedShahid@protonmail.com
#+DATE: 2021-08-04

* Filenames and Absolute/Relative File Paths

We'll learn about files, folders, and how Python can work with them.

If we want our data to persist after our program is finished, we need to save it to a file.

** Fileames and File Paths

Each of our files has 2 key properties. The file name and the file path.

** os module

The os module contains numerous file path related functions that we can use.

*** os.getcwd()

Every program has a setting called the current working directory, this tells us the directory that we are currently in. We can use the getcwd() function in order to find our current working directory.

#+begin_src python :results output :exports both

import os

print(os.getcwd())

#+end_src

#+RESULTS:
: /home/mohammeds/Documents/Automate the Boring Stuff/Section 11: Files

*** os.chdir()

We can also change the current working directory using this chdir() function.

#+begin_src python :results output :exports both

import os

print(os.getcwd())

os.chdir("/")

print(os.getcwd())

#+end_src

#+RESULTS:
: /home/mohammeds/Documents/Automate the Boring Stuff/Section 11: Files
: /

** Absolute and Relative Paths

There are two kinds of file paths, relative and absolute. The absolute file path begins with the root directory and gives you the complete location of the file. A relative file path is relative to the current working directory.

** . and .. Folders

These are not real directories, but they can be used with relative paths. The single dot stands for this directory while two dots stands for the paret directory, the directory that your current working directory is in.

** os.path module
*** os.path.join()

This is a join function inside of a path module inside of an os module. It takes several string arguments and returns a string value of a path for the os that you are using.

#+begin_src python :results output :exports both

import os
print(os.path.join("folder1","folder2","folder3","file.png"))

#+end_src

#+RESULTS:
: folder1/folder2/folder3/file.png

*** os.path.abspath()

The abspath() function will return the absolute path of the path that you pass it.

#+begin_src python :results output :exports both

import os

print(os.path.abspath("Section 11.org"))


#+end_src

#+RESULTS:
: /home/mohammeds/Documents/Automate the Boring Stuff/Section 11: Files/Section 11.org

*** os.path.isabs()

The isabs() function is a way to determine if a given path is absolute.

#+begin_src python :results output :exports both

import os

print(os.path.abspath("Section 11.org"))

print(os.path.isabs("Section 11.org"))

print(os.path.abspath("/home/mohammeds/Documents/Automate the Boring Stuff/Section 11: Files/Section 11.org"))

print(os.path.isabs("/home/mohammeds/Documents/Automate the Boring Stuff/Section 11: Files/Section 11.org"))

#+end_src

#+RESULTS:
: /home/mohammeds/Documents/Automate the Boring Stuff/Section 11: Files/Section 11.org
: False
: /home/mohammeds/Documents/Automate the Boring Stuff/Section 11: Files/Section 11.org
: True

*** os.path.relpath()

This function will give you the relative path between two paths. The first argument is the file/directory we want to get to and the second is the directory we are already in.



#+begin_src python :results output :exports both

import os

print(os.path.relpath("Section 11.org", "/usr/bin"))

print(os.path.relpath("Section 11.org", "/home/mohammeds/"))


#+end_src

#+RESULTS:
: ../../home/mohammeds/Documents/Automate the Boring Stuff/Section 11: Files/Section 11.org
: Documents/Automate the Boring Stuff/Section 11: Files/Section 11.org

*** os.path.dirname()

This function pulls out just the directory part of the path.

#+begin_src python :results output :exports both

import os

print(os.path.dirname("/home/mohammeds/Documents/Automate the Boring Stuff/Section 11: Files/Section 11.org"))

#+end_src

#+RESULTS:
:
: /home/mohammeds/Documents/Automate the Boring Stuff/Section 11: Files

