Section 11: Files/Section 11.tex
% Created 2021-08-04 Wed 17:20
% Intended LaTeX compiler: pdflatex
\documentclass[11pt]{article}
\usepackage[utf8]{inputenc}
\usepackage[T1]{fontenc}
\usepackage{graphicx}
\usepackage{grffile}
\usepackage{longtable}
\usepackage{wrapfig}
\usepackage{rotating}
\usepackage[normalem]{ulem}
\usepackage{amsmath}
\usepackage{textcomp}
\usepackage{amssymb}
\usepackage{capt-of}
\usepackage{hyperref}
\author{Mohammed Asir Shahid}
\date{2021-08-04}
\title{Section 11\\\medskip
\large Files}
\hypersetup{
 pdfauthor={Mohammed Asir Shahid},
 pdftitle={Section 11},
 pdfkeywords={},
 pdfsubject={},
 pdfcreator={Emacs 27.2 (Org mode 9.5)}, 
 pdflang={English}}
\begin{document}

\maketitle
\tableofcontents


\section{Filenames and Absolute/Relative File Paths}
\label{sec:org4238179}

We'll learn about files, folders, and how Python can work with them.

If we want our data to persist after our program is finished, we need to save it to a file.

\subsection{Fileames and File Paths}
\label{sec:orgaffca4e}

Each of our files has 2 key properties. The file name and the file path.

\subsection{os module}
\label{sec:orgf004cef}

The os module contains numerous file path related functions that we can use.

\subsubsection{os.getcwd()}
\label{sec:org96eeb33}

Every program has a setting called the current working directory, this tells us the directory that we are currently in. We can use the getcwd() function in order to find our current working directory.

\begin{verbatim}

import os

print(os.getcwd())

\end{verbatim}

\begin{verbatim}
/home/mohammeds/Documents/Automate the Boring Stuff/Section 11: Files
\end{verbatim}

\subsubsection{os.chdir()}
\label{sec:orgc01deb3}

We can also change the current working directory using this chdir() function.

\begin{verbatim}

import os

print(os.getcwd())

os.chdir("/")

print(os.getcwd())

\end{verbatim}

\begin{verbatim}
/home/mohammeds/Documents/Automate the Boring Stuff/Section 11: Files
/
\end{verbatim}

\subsection{Absolute and Relative Paths}
\label{sec:orga5fe18a}

There are two kinds of file paths, relative and absolute. The absolute file path begins with the root directory and gives you the complete location of the file. A relative file path is relative to the current working directory.

\subsection{. and .. Folders}
\label{sec:org6c22e2b}

These are not real directories, but they can be used with relative paths. The single dot stands for this directory while two dots stands for the paret directory, the directory that your current working directory is in.

\subsection{os.path module}
\label{sec:org35802ed}
\subsubsection{os.path.join()}
\label{sec:org66a20ed}

This is a join function inside of a path module inside of an os module. It takes several string arguments and returns a string value of a path for the os that you are using.

\begin{verbatim}

import os
print(os.path.join("folder1","folder2","folder3","file.png"))

\end{verbatim}

\begin{verbatim}
folder1/folder2/folder3/file.png
\end{verbatim}

\subsubsection{os.path.abspath()}
\label{sec:org1d164d0}

The abspath() function will return the absolute path of the path that you pass it.

\begin{verbatim}

import os

print(os.path.abspath("Section 11.org"))


\end{verbatim}

\begin{verbatim}
/home/mohammeds/Documents/Automate the Boring Stuff/Section 11: Files/Section 11.org
\end{verbatim}

\subsubsection{os.path.isabs()}
\label{sec:org45e05b3}

The isabs() function is a way to determine if a given path is absolute.

\begin{verbatim}

import os

print(os.path.abspath("Section 11.org"))

print(os.path.isabs("Section 11.org"))

print(os.path.abspath("/home/mohammeds/Documents/Automate the Boring Stuff/Section 11: Files/Section 11.org"))

print(os.path.isabs("/home/mohammeds/Documents/Automate the Boring Stuff/Section 11: Files/Section 11.org"))

\end{verbatim}

\begin{verbatim}
/home/mohammeds/Documents/Automate the Boring Stuff/Section 11: Files/Section 11.org
False
/home/mohammeds/Documents/Automate the Boring Stuff/Section 11: Files/Section 11.org
True
\end{verbatim}

\subsubsection{os.path.relpath()}
\label{sec:org7ef7eec}

This function will give you the relative path between two paths. The first argument is the file/directory we want to get to and the second is the directory we are already in.



\begin{verbatim}

import os

print(os.path.relpath("Section 11.org", "/usr/bin"))

print(os.path.relpath("Section 11.org", "/home/mohammeds/"))


\end{verbatim}

\begin{verbatim}
../../home/mohammeds/Documents/Automate the Boring Stuff/Section 11: Files/Section 11.org
Documents/Automate the Boring Stuff/Section 11: Files/Section 11.org
\end{verbatim}

\subsubsection{os.path.dirname()}
\label{sec:org1162c6f}

This function pulls out just the directory part of the path.

\begin{verbatim}

import os

print(os.path.dirname("/home/mohammeds/Documents/Automate the Boring Stuff/Section 11: Files/Section 11.org"))

\end{verbatim}

\begin{verbatim}
/home/mohammeds/Documents/Automate the Boring Stuff/Section 11: Files
\end{verbatim}
