Section 11: Files/Section 11.org
*** os.path.basename()

This function pulls out just the last part of the path. Either the filename or just the directory itself if there is no file in the path.

#+begin_src python :results output :exports both

import os

print(os.path.basename("/home/mohammeds/Documents/Automate the Boring Stuff/Section 11: Files/Section 11.org"))

#+end_src

#+RESULTS:
: Section 11.org

*** os.path.exists()

This function can check and see if the path you are passing actually exists.

#+begin_src python :results output :exports both

import os

print(os.path.exists("/home/mohammeds/Documents/Automate the Boring Stuff/Section 11: Files/Section 11.org"))

print(os.path.exists("/home/mohammeds/Fake File Path"))

#+end_src

#+RESULTS:
: True
: False

*** os.path.isfile()

We can use this function to see if what we pass to it is a file or not.

#+begin_src python :results output :exports both

import os

print(os.path.isfile("/home/mohammeds/Documents/Automate the Boring Stuff/Section 11: Files/Section 11.org"))

print(os.path.isfile("/home/mohammeds/Fake File Path"))

#+end_src

#+RESULTS:
: True
: False

*** os.path.isdir()

We can use this function to see if what we pass to it is a directory or not.

#+begin_src python :results output :exports both

import os

print(os.path.isdir("/home/mohammeds/Documents/Automate the Boring Stuff/Section 11: Files/Section 11.org"))

print(os.path.isdir("/home/mohammeds/"))

#+end_src

#+RESULTS:
: False
: True

*** os.path.getsize()

This function gives us the size of the file in bytes.

#+begin_src python :results output :exports both

import os

print(os.path.getsize("/home/mohammeds/Documents/Automate the Boring Stuff/Section 11: Files/Section 11.org"))

#+end_src

#+RESULTS:
: 5781

** os.listdir()

This function isn't in the path module. It can be passed a file path of a folder and then it'll return a list of strings of the filenames and folder names that it contains.

#+begin_src python :results output :exports both

import os

print(os.listdir("/home/mohammeds/Documents"))

#+end_src

#+RESULTS:
: ['[Chapman and Hall_CRC the R Ser] Albert, Jim_ Baumer, Benjamin S._ Marchi, Max - Analyzing Baseball Data with R (2018, Chapman and Hall_CRC) - libgen.lc.pdf', 'bedrock-linux-0.7.20beta1-x86_64.sh', 'fstab.txt', 'Verify Payment.pdf', 'mission-369-advanced-regular-expressions-takeaways.pdf', 'userguide.pdf', 'Quidditch Through the Ages - J.K. Rowling.pdf', 'Resume', 'SmashCharacters.txt', 'LFS-BOOK-10.1.pdf', 'Linux From Scratch - Version 10.1 - LFS-BOOK-10.1.pdf', 'Oathbringer_ Book Three of the Stormlight Archive_B01NAWAH85.kfx', 'Andrew Ng Machine Learning Lectures', 'Hugo Websites', 'Data Scientist in Python DataQuest', 'mohammed-shahid-python-for-data-science-fundamentals.pdf', 'README.md', '.git', 'mkdir', 'Crypto Trading Bot', 'Machine Trading', 'The Home Depot - Order Confirmation.pdf', 'Online Return Center.pdf', 'LeetCode', 'Kaggle', 'Coursera', 'Data Analyst in R DataQuest', 'edX', 'org-basics.org', 'happybday.org', 'org', 'letter.org', 'AB_NYC_2019.csv', 'cse351_hw1_fazli_faraz_110018236.ipynb', '.ipynb_checkpoints', 'mariaradio.org', '.auctex-auto', 'mariaradio.tex', 'mariaradio.pdf', 'mariaradio.md', 'mariaradio.html', 'Order Confirmation _ Law School Admission Council.pdf', 'marialetter.org', 'Automate the Boring Stuff', 'TEKgence Application Form.xlsx', '.dir-locals.el']

** Example Code: Finding the total size of all files in a folder.

#+begin_src python :results output :exports both

import os

totalSize=0

for file in os.listdir("/home/mohammeds/Documents"):
    if not os.path.isfile(os.path.join("/home/mohammeds/Documents", file)):
        continue
    totalSize+=os.path.getsize(os.path.join("/home/mohammeds/Documents", file))

print(totalSize)

#+end_src

#+RESULTS:
: 382371482

** os.makedirs()

This function can create directories for you.

#+begin_src python :results output :exports both

import os

print(os.getcwd())

print(os.listdir())

os.makedirs("TestDir")

print(os.listdir())

#+end_src

* Reading and Writing Plaintext Files

We can start writing strings to files that we create in order to save information. We can then read this data with Python.

** Plaintext and Binary Files

Plaintext files only contain basic text characters and don't include information about color or font. Often times they have .txt extensions. Python scripts are also plain text files, except they use the .py file extension.

They can be opened with text editors such as Emacs.

Binary files are all other types of files. PDF, JPG, PNG, etc. When you open these with a text editor, it will be impossible to understand.

** Reading or Writing Files in Python

There are three main steps for reading and writing files in Python.

*** The open() Function

This function opens files.

#+begin_src python :results output :exports both

open("hello.txt")

#+end_src

#+RESULTS:

***  Read Mode

The open() function opens the file in read mode. This only lets you read the data, it does not let you modify it.

***  The read() method

This method lets you read the opened file.

