Section 11: Files/Section 11.org
***  The close() method

This method closes the opened file. If you want to continue accessing it, you should save it to a variable.

#+begin_src python :results output :exports both

helloFile=open("hello.txt")


content=helloFile.read()

print(content)

helloFile.close()

#+end_src

#+RESULTS:
: Hello!
:

*** The readlines() Method

This method returns all of the lines as strings within a list.

#+begin_src python :results output :exports both

helloFile=open("hello.txt")
content=helloFile.readlines()

print(content)

#+end_src

#+RESULTS:
: ['Hello!\n']

*** Write mode

In order to write to a file, it needs to be opened in write or append mode. This can overwrite existing files. For write mode, you can pass in a "w" argument to the open() function.

#+begin_src python :results output :exports both

helloFile=open("hello2.txt","w")
helloFile.write("Hello!!!!")

#+end_src

#+RESULTS:

*** Append mode

In order to write to a file, it needs to be opened in write or append mode. This can overwrite existing files. For append mode, you can pass in a "a" argument to the open() function.

#+begin_src python :results output :exports both

helloFile=open("hello.txt", "a")
helloFile.write("How are you?")

#+end_src

#+RESULTS:

*** Example

#+begin_src python :results output :exports both


baconFile=open("bacon.txt", "w")

baconFile.write("Bacon is not a vegetable")
baconFile.close()

baconFile=open("bacon.txt")

print(baconFile.read())

#+end_src

#+RESULTS:
: Bacon is not a vegetable

** The shelve Module

Writing and reading text files is a good way to store single long strings, but if we want to save more complex data structures like lists and dictionaries, then we can save Python programs to binary shelve files.

*** The shelve.open() Method

This method can open shelve files.

#+begin_src python :results output :exports both

import shelve

shelfFile=shelve.open("mydata")
shelfFile["cats"]=["Zophie","Pooka","Simon","Fat-tail","Cleo"]
shelfFile.close()

shelfFile=shelve.open("mydata")
print(shelfFile["cats"])

#+end_src

#+RESULTS:
: ['Zophie', 'Pooka', 'Simon', 'Fat-tail', 'Cleo']

The benefit of using the shelve module is that you can store lists, dictionaries, and non text data and then reopen them in the future.

*** The keys() and values() Shelf Methods

Shelf file objects are very similar to dictionaries in the sense that they have keys and values.

#+begin_src python :results output :exports both

import shelve

shelfFile=shelve.open("mydata")

print(shelfFile.keys())
print(shelfFile.values())


print(list(shelfFile.keys()))
print(list(shelfFile.values()))

shelfFile.close()
#+end_src
* Copying and Moving Files and Folders

We can also organize files on our drive using Python.

** Shell Utilities Module

This module has functions that let us copy, rename, and delete files in Python programs.

*** shutil.copy() Function

This function lets us copy files in Python. We can either copy and leave the filename or copy and give a new file name.

#+begin_src python :results output :exports both

import shutil,os

shutil.copy("hello2.txt", "TestDir")

shutil.copy("hello2.txt", "TestDir/newhello2.txt")

print(os.listdir("TestDir"))

#+end_src

#+RESULTS:
: ['hello2.txt', 'newhello2.txt']

*** shutil.copytree() Function

The copy function works for single files, but what if we want to copy an entire folder? Then we can use the copytree function.


#+begin_src python :results output :exports both

import shutil,os

shutil.copytree("TestDir","TestDirBackup")

#+end_src

#+RESULTS:

#+begin_src python :results output :exports both

import shutil,os

print(os.listdir("TestDirBackup"))

#+end_src

#+RESULTS:
: ['hello2.txt', 'newhello2.txt']

*** shutil.move() function

This can be used for moving and renaming files. If you want to rename a file, you can move it to the same directory using the move() function and then change the filename.

#+begin_src python :results output :exports both

import shutil,os

shutil.move("TestDirBackup/newhello2.txt", ".")

print(os.listdir("TestDirBackup"))

#+end_src

#+RESULTS:
: ['hello2.txt']

* Deleting Files

There are three functions that we can use for deleting files.

** Deleting Functions

*** os.unlink() (Deletes a single file.)

#+begin_src python :results output :exports both

import os

os.unlink("hello2.txt")


#+end_src

#+RESULTS:

#+begin_src python :results output :exports both

import os

print(os.listdir())

#+end_src

#+RESULTS:
: ['.gitkeep', 'Section 11.org', '.auctex-auto', 'Section 11.tex', 'Section 11.pdf', 'Section 11.md', 'udemy-automate-boring-python-lesson-30.mp4', 'udemy-automate-boring-python-lesson-31.mp4', 'udemy-automate-boring-python-lesson-32.mp4', 'udemy-automate-boring-python-lesson-33.mp4', 'udemy-automate-boring-python-lesson-34.mp4', 'TestDir', 'hello.txt', 'bacon.txt', 'mydata', 'TestDirBackup', 'newhello2.txt']

*** os.rmdir() (Delete an empty folder)

This function only removes directories that are completely empty. If the directory you try to delete has data, Python will return an error.

