Section 11: Files/Section 11.tex

\subsubsection{The close() method}
\label{sec:org4c45975}

This method closes the opened file. If you want to continue accessing it, you should save it to a variable.

\begin{verbatim}

helloFile=open("hello.txt")


content=helloFile.read()

print(content)

helloFile.close()

\end{verbatim}

\begin{verbatim}
Hello!
How are you?How are you?How are you?How are you?How are you?
\end{verbatim}

\subsubsection{The readlines() Method}
\label{sec:org8fb95be}

This method returns all of the lines as strings within a list.

\begin{verbatim}

helloFile=open("hello.txt")
content=helloFile.readlines()

print(content)

\end{verbatim}

\begin{verbatim}
['Hello!\n', 'How are you?How are you?How are you?How are you?How are you?']
\end{verbatim}

\subsubsection{Write mode}
\label{sec:orgfaa81c9}

In order to write to a file, it needs to be opened in write or append mode. This can overwrite existing files. For write mode, you can pass in a ``w'' argument to the open() function.

\begin{verbatim}

helloFile=open("hello2.txt","w")
helloFile.write("Hello!!!!")

\end{verbatim}

\subsubsection{Append mode}
\label{sec:orgbdecb30}

In order to write to a file, it needs to be opened in write or append mode. This can overwrite existing files. For append mode, you can pass in a ``a'' argument to the open() function.

\begin{verbatim}

helloFile=open("hello.txt", "a")
helloFile.write("How are you?")

\end{verbatim}

\subsubsection{Example}
\label{sec:orge44edd1}

\begin{verbatim}


baconFile=open("bacon.txt", "w")

baconFile.write("Bacon is not a vegetable")
baconFile.close()

baconFile=open("bacon.txt")

print(baconFile.read())

\end{verbatim}

\begin{verbatim}
Bacon is not a vegetable
\end{verbatim}

\subsection{The shelve Module}
\label{sec:orgade6e10}

Writing and reading text files is a good way to store single long strings, but if we want to save more complex data structures like lists and dictionaries, then we can save Python programs to binary shelve files.

\subsubsection{The shelve.open() Method}
\label{sec:orgdae3e4b}

This method can open shelve files.

\begin{verbatim}

import shelve

shelfFile=shelve.open("mydata")
shelfFile["cats"]=["Zophie","Pooka","Simon","Fat-tail","Cleo"]
shelfFile.close()

shelfFile=shelve.open("mydata")
print(shelfFile["cats"])

\end{verbatim}

\begin{verbatim}
['Zophie', 'Pooka', 'Simon', 'Fat-tail', 'Cleo']
\end{verbatim}


The benefit of using the shelve module is that you can store lists, dictionaries, and non text data and then reopen them in the future.

\subsubsection{The keys() and values() Shelf Methods}
\label{sec:orgc8b9057}

Shelf file objects are very similar to dictionaries in the sense that they have keys and values.

\begin{verbatim}

import shelve

shelfFile=shelve.open("mydata")

print(shelfFile.keys())
print(shelfFile.values())


print(list(shelfFile.keys()))
print(list(shelfFile.values()))

shelfFile.close()
\end{verbatim}

\begin{verbatim}
KeysView(<shelve.DbfilenameShelf object at 0x7f13ee031130>)
ValuesView(<shelve.DbfilenameShelf object at 0x7f13ee031130>)
['cats']
[['Zophie', 'Pooka', 'Simon', 'Fat-tail', 'Cleo']]
\end{verbatim}

\section{Copying and Moving Files and Folders}
\label{sec:orga43f392}

We can also organize files on our drive using Python.

\subsection{Shell Utilities Module}
\label{sec:org22139b5}

This module has functions that let us copy, rename, and delete files in Python programs.

\subsubsection{shutil.copy() Function}
\label{sec:org732d881}

This function lets us copy files in Python. We can either copy and leave the filename or copy and give a new file name.

\begin{verbatim}

import shutil,os

shutil.copy("hello2.txt", "TestDir")

shutil.copy("hello2.txt", "TestDir/newhello2.txt")

print(os.listdir("TestDir"))

\end{verbatim}

\begin{verbatim}
['hello2.txt', 'newhello2.txt']
\end{verbatim}

\subsubsection{shutil.copytree() Function}
\label{sec:org3fbc4ba}

The copy function works for single files, but what if we want to copy an entire folder? Then we can use the copytree function.


\begin{verbatim}

import shutil,os

shutil.copytree("TestDir","TestDirBackup")

\end{verbatim}

\begin{verbatim}

import shutil,os

print(os.listdir("TestDirBackup"))

\end{verbatim}

\begin{verbatim}
['hello2.txt', 'newhello2.txt']
\end{verbatim}

\subsubsection{shutil.move() function}
\label{sec:org42ad127}

This can be used for moving and renaming files. If you want to rename a file, you can move it to the same directory using the move() function and then change the filename.

\begin{verbatim}

import shutil,os

shutil.move("TestDirBackup/newhello2.txt", ".")

print(os.listdir("TestDirBackup"))

\end{verbatim}

\section{Deleting Files}
\label{sec:org0614349}

There are three functions that we can use for deleting files.

\subsection{Deleting Functions}
\label{sec:org5087f44}

\subsubsection{os.unlink() (Deletes a single file.)}
\label{sec:org10e4ef6}

\begin{verbatim}

import os

os.unlink("hello2.txt")


\end{verbatim}

\begin{verbatim}

import os

print(os.listdir())

\end{verbatim}

\begin{verbatim}
['.gitkeep', 'Section 11.org', '.auctex-auto', 'Section 11.tex', 'Section 11.pdf', 'Section 11.md', 'udemy-automate-boring-python-lesson-30.mp4', 'udemy-automate-boring-python-lesson-31.mp4', 'udemy-automate-boring-python-lesson-32.mp4', 'udemy-automate-boring-python-lesson-33.mp4', 'udemy-automate-boring-python-lesson-34.mp4', 'TestDir', 'hello.txt', 'mydata', 'newhello2.txt', 'bacon.txt', 'TestDirBackup']
\end{verbatim}

\subsubsection{os.rmdir() (Delete an empty folder)}
\label{sec:org9e9da03}

This function only removes directories that are completely empty. If the directory you try to delete has data, Python will return an error.
