Section 11: Files/Section 11.md


<a id="org52d6b47"></a>

### The close() method

This method closes the opened file. If you want to continue accessing it, you should save it to a variable.

    
    helloFile=open("hello.txt")
    
    
    content=helloFile.read()
    
    print(content)
    
    helloFile.close()

    Hello!
    How are you?How are you?How are you?How are you?How are you?How are you?


<a id="orgf5a7fb3"></a>

### The readlines() Method

This method returns all of the lines as strings within a list.

    
    helloFile=open("hello.txt")
    content=helloFile.readlines()
    
    print(content)

    ['Hello!\n', 'How are you?How are you?How are you?How are you?How are you?How are you?']


<a id="org3a8617e"></a>

### Write mode

In order to write to a file, it needs to be opened in write or append mode. This can overwrite existing files. For write mode, you can pass in a &ldquo;w&rdquo; argument to the open() function.

    
    helloFile=open("hello2.txt","w")
    helloFile.write("Hello!!!!")


<a id="orgd12b1cc"></a>

### Append mode

In order to write to a file, it needs to be opened in write or append mode. This can overwrite existing files. For append mode, you can pass in a &ldquo;a&rdquo; argument to the open() function.

    
    helloFile=open("hello.txt", "a")
    helloFile.write("How are you?")


<a id="org8c8c74f"></a>

### Example

    
    
    baconFile=open("bacon.txt", "w")
    
    baconFile.write("Bacon is not a vegetable")
    baconFile.close()
    
    baconFile=open("bacon.txt")
    
    print(baconFile.read())

    Bacon is not a vegetable


<a id="org2935273"></a>

## The shelve Module

Writing and reading text files is a good way to store single long strings, but if we want to save more complex data structures like lists and dictionaries, then we can save Python programs to binary shelve files.


<a id="orgaa6db6a"></a>

### The shelve.open() Method

This method can open shelve files.

    
    import shelve
    
    shelfFile=shelve.open("mydata")
    shelfFile["cats"]=["Zophie","Pooka","Simon","Fat-tail","Cleo"]
    shelfFile.close()
    
    shelfFile=shelve.open("mydata")
    print(shelfFile["cats"])

    ['Zophie', 'Pooka', 'Simon', 'Fat-tail', 'Cleo']

The benefit of using the shelve module is that you can store lists, dictionaries, and non text data and then reopen them in the future.


<a id="orga651268"></a>

### The keys() and values() Shelf Methods

Shelf file objects are very similar to dictionaries in the sense that they have keys and values.

    
    import shelve
    
    shelfFile=shelve.open("mydata")
    
    print(shelfFile.keys())
    print(shelfFile.values())
    
    
    print(list(shelfFile.keys()))
    print(list(shelfFile.values()))
    
    shelfFile.close()

    KeysView(<shelve.DbfilenameShelf object at 0x7f9b2a143130>)
    ValuesView(<shelve.DbfilenameShelf object at 0x7f9b2a143130>)
    ['cats']
    [['Zophie', 'Pooka', 'Simon', 'Fat-tail', 'Cleo']]


<a id="orgc063dbb"></a>

# Copying and Moving Files and Folders

We can also organize files on our drive using Python.


<a id="org3d35d4c"></a>

## Shell Utilities Module

This module has functions that let us copy, rename, and delete files in Python programs.


<a id="orgb104d28"></a>

### shutil.copy() Function

This function lets us copy files in Python. We can either copy and leave the filename or copy and give a new file name.

    
    import shutil,os
    
    shutil.copy("hello2.txt", "TestDir")
    
    shutil.copy("hello2.txt", "TestDir/newhello2.txt")
    
    print(os.listdir("TestDir"))

    ['hello2.txt', 'newhello2.txt']


<a id="orgf2388c9"></a>

### shutil.copytree() Function

The copy function works for single files, but what if we want to copy an entire folder? Then we can use the copytree function.

    
    import shutil,os
    
    shutil.copytree("TestDir","TestDirBackup")

    
    import shutil,os
    
    print(os.listdir("TestDirBackup"))

    ['hello2.txt', 'newhello2.txt']


<a id="org8f0ab38"></a>

### shutil.move() function

This can be used for moving and renaming files. If you want to rename a file, you can move it to the same directory using the move() function and then change the filename.

    
    import shutil,os
    
    shutil.move("TestDirBackup/newhello2.txt", ".")
    
    print(os.listdir("TestDirBackup"))


<a id="org2a4e9e3"></a>

# Deleting Files

There are three functions that we can use for deleting files.


<a id="org9fb0406"></a>

## Deleting Functions


<a id="org1668fe0"></a>

### os.unlink() (Deletes a single file.)

    
    import os
    
    os.unlink("hello2.txt")

    
    import os
    
    print(os.listdir())

    ['.gitkeep', 'Section 11.org', '.auctex-auto', 'Section 11.tex', 'Section 11.pdf', 'Section 11.md', 'udemy-automate-boring-python-lesson-30.mp4', 'udemy-automate-boring-python-lesson-31.mp4', 'udemy-automate-boring-python-lesson-32.mp4', 'udemy-automate-boring-python-lesson-33.mp4', 'udemy-automate-boring-python-lesson-34.mp4', 'TestDir', 'hello.txt', 'mydata', 'newhello2.txt', 'bacon.txt', 'TestDirBackup']


<a id="org841a9e7"></a>

### os.rmdir() (Delete an empty folder)

This function only removes directories that are completely empty. If the directory you try to delete has data, Python will return an error.
