Section 11: Files/Section 11.org
*** shutil.rmtree() (Deletes a folder and its entire contents)

This is the delete analog of the copytree() function.

#+begin_src python :results output :exports both

import os,shutil

shutil.rmtree("TestDirBackup")

print(os.listdir())

#+end_src

#+RESULTS:
: ['.gitkeep', 'Section 11.org', '.auctex-auto', 'Section 11.tex', 'Section 11.pdf', 'Section 11.md', 'udemy-automate-boring-python-lesson-30.mp4', 'udemy-automate-boring-python-lesson-31.mp4', 'udemy-automate-boring-python-lesson-32.mp4', 'udemy-automate-boring-python-lesson-33.mp4', 'udemy-automate-boring-python-lesson-34.mp4', 'TestDir', 'hello.txt', 'bacon.txt', 'mydata', 'newhello2.txt']

** Dry Run

These deleting functions can be dangerous, so in order to make sure nothing goes wrong, we should do a dry run when using them.

Here we would comment out any line containing deleting functions and then instead printing out the files that we were trying to delete. This can help us make sure that we are not deleting the wrong thing.

#+begin_src python :results output :exports both

import os,shutil

os.chdir("/home/mohammeds/Documents")

for filename in os.listdir():
    if filename.endswith(".rxt"):
#        os.unlink(filename)
        print(filename)

#+end_src

#+RESULTS:

** The send2trash Module

These deleting functions are still dangerous, even when doing a dry run since they will be deleted permanently. Instead, we can use the send2trash module's functions which sends the files to the recycling bin.

We need to install it using pip.

#+begin_src bash
pip install send2trash
#+end_src

#+RESULTS:
| Defaulting  | to      | user       | installation | because | normal                           | site-packages | is | not | writeable |
| Requirement | already | satisfied: | send2trash   | in      | /usr/lib/python3.9/site-packages | (1.4.2)       |    |     |           |

#+begin_src python :results output :exports both

import send2trash

send2trash.send2trash("bacon.txt")

#+end_src

#+RESULTS:
